Revit 2027 API
BuiltInFailures.IlluminationFailures.RoomCoefficientUtilizationWarning Property
 Estimated Illumination failed. Coefficient of utilization not set for lighting fixture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomCoefficientUtilizationWarning { get; }
Public Shared ReadOnly Property RoomCoefficientUtilizationWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomCoefficientUtilizationWarning {
	FailureDefinitionId^ get ();
}
static member RoomCoefficientUtilizationWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.IlluminationFailures Class
Autodesk.Revit.DB Namespace